sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/getNoteAttachment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.getnoteattachment">
   <soapenv:Header/>
   <soapenv:Body>
   	 <sug:sugarCRMApiUrl>https://ypbvhe6054.trial.sugarcrm.com/soap.php</sug:sugarCRMApiUrl>
      <sug:session>cro7jca0b80vklrha2u4qdlnk7</sug:session>
      <sug:id>4b83ec71-193e-f492-c43d-52bc1af74c8d</sug:id>
   </soapenv:Body>
</soapenv:Envelope>